Coderyne/Rhino-Pi-X1-ROS2HomeRobots/Code/STM32/ros2-wheel-foot-car/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "bsp_dwt.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define DC24_1__OUTPUT_Pin GPIO_PIN_13
#define DC24_1__OUTPUT_GPIO_Port GPIOC
#define DC24_0__OUTPUT_Pin GPIO_PIN_14
#define DC24_0__OUTPUT_GPIO_Port GPIOC
#define DC5__OUTPUT_Pin GPIO_PIN_15
#define DC5__OUTPUT_GPIO_Port GPIOC
#define ACC_CS_Pin GPIO_PIN_0
#define ACC_CS_GPIO_Port GPIOC
#define GYRO_CS_Pin GPIO_PIN_3
#define GYRO_CS_GPIO_Port GPIOC
#define DI_Pin GPIO_PIN_0
#define DI_GPIO_Port GPIOA
#define DO_Pin GPIO_PIN_2
#define DO_GPIO_Port GPIOA
#define BAT_VOLTAGE__ADC_Pin GPIO_PIN_4
#define BAT_VOLTAGE__ADC_GPIO_Port GPIOC
#define CS_Pin GPIO_PIN_9
#define CS_GPIO_Port GPIOE
#define ACC_INT_Pin GPIO_PIN_10
#define ACC_INT_GPIO_Port GPIOE
#define GYRO_INT_Pin GPIO_PIN_12
#define GYRO_INT_GPIO_Port GPIOE
#define CLK_Pin GPIO_PIN_13
#define CLK_GPIO_Port GPIOE
#define BEEP_Pin GPIO_PIN_15
#define BEEP_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */
typedef float fp32;
typedef double fp64;
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
